In [1]:
import numpy as np
import pandas as pd

In [17]:
employees = pd.DataFrame({
    'employee_id' : [1,2,3,4,5],
    'name' : ["loki","lucky","rawat","lakku","luke"],
    'deparment': ['HR','IT','Finance','IT','HR']
})


salaries = pd.DataFrame({
    'employee_id' : [1,2,3,6,7],
    'salary' : [17000000,28000000,3800000,4900000,5500000],
    'bonus' : [10000,20000,40000,60000,45000]
})

In [18]:
employees

   employee_id   name deparment
0            1   loki        HR
1            2  lucky        IT
2            3  rawat   Finance
3            4  lakku        IT
4            5   luke        HR

In [19]:
salaries

   employee_id    salary  bonus
0            1  17000000  10000
1            2  28000000  20000
2            3   3800000  40000
3            6   4900000  60000
4            7   5500000  45000

In [20]:
pd.merge(employees,salaries,on='employee_id',how='inner')

   employee_id   name deparment    salary  bonus
0            1   loki        HR  17000000  10000
1            2  lucky        IT  28000000  20000
2            3  rawat   Finance   3800000  40000

In [21]:
pd.merge(employees,salaries,on='employee_id',how='outer')

   employee_id   name deparment      salary    bonus
0            1   loki        HR  17000000.0  10000.0
1            2  lucky        IT  28000000.0  20000.0
2            3  rawat   Finance   3800000.0  40000.0
3            4  lakku        IT         NaN      NaN
4            5   luke        HR         NaN      NaN
5            6    NaN       NaN   4900000.0  60000.0
6            7    NaN       NaN   5500000.0  45000.0

In [22]:
pd.merge(employees,salaries,on='employee_id',how='left')

   employee_id   name deparment      salary    bonus
0            1   loki        HR  17000000.0  10000.0
1            2  lucky        IT  28000000.0  20000.0
2            3  rawat   Finance   3800000.0  40000.0
3            4  lakku        IT         NaN      NaN
4            5   luke        HR         NaN      NaN

In [23]:
pd.merge(employees,salaries,on='employee_id',how='right')

   employee_id   name deparment    salary  bonus
0            1   loki        HR  17000000  10000
1            2  lucky        IT  28000000  20000
2            3  rawat   Finance   3800000  40000
3            6    NaN       NaN   4900000  60000
4            7    NaN       NaN   5500000  45000

Concatination of 2 Dataframe

In [46]:
df1 = pd.DataFrame({
    'A' : ['A0','A1','A2'],
    'B' : ['B0','B1','B2'],
    'C' : ['C0','C1','C2']
})
df2 = pd.DataFrame({
    'A' : ['A3','A4','A5'],
    'B' : ['B3','B4','B5'],
    'C' : ['C3','C4','C5']
})

In [26]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [27]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [28]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [29]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

joining of two dataframe

In [56]:
df1 = pd.DataFrame({
    'name' : ["bob","alice","jone"]
}, index = [1,2,3])
df2 = pd.DataFrame({
    'score' : [90,89,98]
}, index = [2,3,4])

In [57]:
df1

    name
1    bob
2  alice
3   jone

In [58]:
df2

   score
2     90
3     89
4     98

In [59]:
df1.join(df2)

    name  score
1    bob    NaN
2  alice   90.0
3   jone   89.0

In [60]:
df1.join(df2,how='outer')

    name  score
1    bob    NaN
2  alice   90.0
3   jone   89.0
4    NaN   98.0